export interface Stop { name: string; lat: number; lng: number; }

export const LINE_STOPS: Record<'Red' | 'Green' | 'Blue', Stop[]> = {
  Green: [
    { name: 'จุดจอดรถบัส PKY',                            lat: 19.02562,   lng: 99.895015  },
    { name: 'สถานีหน้าคณะศิลปศาสตร์',                     lat: 19.0294776, lng: 99.8957507 },
    { name: 'สถานีหน้าคณะพยาบาลศาสตร์',                   lat: 19.0306625, lng: 99.897615  },
    { name: 'สถานีหน้าคณะวิศวกรรมศาสตร์',                 lat: 19.0307963, lng: 99.9011997 },
    { name: 'สถานีหน้าคณะทันตแพทยศาสตร์',                 lat: 19.0298661, lng: 99.9154259 },
    { name: 'จุดจอดรถบัสหน้ามหาวิทยาลัย',                lat: 19.030564,  lng: 99.923098  },
    { name: 'สถานีหน้าเรือนเอื้องคำ',                     lat: 19.028584,  lng: 99.906696  },
    { name: 'สถานีหน้าคณะวิศวกรรมศาสตร์ (ขากลับ)',        lat: 19.0305663, lng: 99.901226  },
    { name: 'สถานีหน้าหอประชุมพญางำเมือง',                lat: 19.0299998, lng: 99.8977114 },
    { name: 'สถานีหน้าอาคารสำนักงานอธิการบดี',            lat: 19.0290339, lng: 99.8960666 },
  ],
  Blue: [
    { name: 'จุดจอดรถบัสประตูสาม',                        lat: 19.02281,   lng: 99.89537   },
    { name: 'สถานีหน้าคณะเทคโนโลยีสารสนเทศและการสื่อสาร', lat: 19.0284949, lng: 99.8998267 },
    { name: 'สถานีหน้าคณะวิศวกรรมศาสตร์',                 lat: 19.0305663, lng: 99.901226  },
    { name: 'สถานีหน้าศูนย์การเรียนรู้เศรษฐกิจพอเพียง',   lat: 19.02696,   lng: 99.899542  },
  ],
  Red: [
    { name: 'สถานีหน้าอาคารสงวนเสริมศรี',                 lat: 19.0342438, lng: 99.8863112 },
    { name: 'สถานีหน้าอาคาร ๙๙ ปี',                       lat: 19.0320031, lng: 99.8934952 },
    { name: 'สถานีหน้าเวียงพะเยา',                        lat: 19.0331648, lng: 99.8908747 },
    { name: 'สถานีหน้าโรงเรียนสาธิตมหาวิทยาลัยพะเยา',    lat: 19.0344118, lng: 99.8842468 },
    { name: 'จุดจอดรถบัส PKY',                            lat: 19.02562,   lng: 99.895015  },
  ],
};

export const LINE_COLORS: Record<'Red' | 'Green' | 'Blue', string> = {
  Red:   '#e74c3c',
  Green: '#2ecc71',
  Blue:  '#3498db',
};

export const LINE_NAMES: Record<'Red' | 'Green' | 'Blue', string> = {
  Red:   'สายหอพัก',
  Green: 'สายหน้ามอ',
  Blue:  'สายประตูสาม',
};
